Return-Path: <linux-kernel-owner@vger.kernel.org>
X-Original-To: lists+linux-kernel@lfdr.de
Delivered-To: lists+linux-kernel@lfdr.de
Received: from vger.kernel.org (vger.kernel.org [23.128.96.18])
	by mail.lfdr.de (Postfix) with ESMTP id 6B80F29EC59
	for <lists+linux-kernel@lfdr.de>; Thu, 29 Oct 2020 14:00:16 +0100 (CET)
Received: (majordomo@vger.kernel.org) by vger.kernel.org via listexpand
        id S1726029AbgJ2M7u (ORCPT <rfc822;lists+linux-kernel@lfdr.de>);
        Thu, 29 Oct 2020 08:59:50 -0400
Received: from mga06.intel.com ([134.134.136.31]:54837 "EHLO mga06.intel.com"
        rhost-flags-OK-OK-OK-OK) by vger.kernel.org with ESMTP
        id S1725355AbgJ2M7q (ORCPT <rfc822;linux-kernel@vger.kernel.org>);
        Thu, 29 Oct 2020 08:59:46 -0400
IronPort-SDR: YYPkTSkHxS1oyRl7UEwhKbImGkOMv2Ev/vz8Ww8Bde1S3GonDAT/6Wt7E+Rr1sThVaV7IaLT2l
 w1cX3Obxvs6A==
X-IronPort-AV: E=McAfee;i="6000,8403,9788"; a="230064221"
X-IronPort-AV: E=Sophos;i="5.77,430,1596524400"; 
   d="xz'?yaml'?scan'208";a="230064221"
X-Amp-Result: UNKNOWN
X-Amp-Original-Verdict: FILE UNKNOWN
X-Amp-File-Uploaded: False
Received: from orsmga005.jf.intel.com ([10.7.209.41])
  by orsmga104.jf.intel.com with ESMTP/TLS/ECDHE-RSA-AES256-GCM-SHA384; 29 Oct 2020 05:58:40 -0700
IronPort-SDR: WIU9ZZSewjv0dLab0JnsbQmAZ3mYSqH37WjT76RcpPD8N0qAVj4AJ+8c8vbhuFaXh8JlbdvEDv
 l6IhhT9GONTg==
X-IronPort-AV: E=Sophos;i="5.77,430,1596524400"; 
   d="xz'?yaml'?scan'208";a="536660847"

#  frame1: R0=3DinvP(id=3D0) R1_w=3Dmap_value(id=3D0,off=3D188,ks=3D4,vs=3D=
23040,umax_value=3D528,var_off=3D(0x0; 0x7ff),s32_max_value=3D2047,u32_max_=
value=3D2047) R2_w=3DinvP256 R3_w=3DinvP(id=3D0) R6=3DinvP56 R7=3DinvP8 R8=
=3DinvP(id=3D9) R9=3Dmap_value(id=3D0,off=3D188,ks=3D4,vs=3D23040,umax_valu=
e=3D528,var_off=3D(0x0; 0x7ff),s32_max_value=3D2047,u32_max_value=3D2047) R=
10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm=
 fp-40=3Dmap_value fp-48=3Dmap_value fp-56=3DinvP10
# 454: (bf) r6 =3D r0
# ; if (!cgroup_node)
# 455: (15) if r8 =3D=3D 0x0 goto pc-19
#  frame1: R0_w=3DinvP(id=3D10,smax_value=3D256) R6_w=3DinvP(id=3D10,smax_v=
alue=3D256) R7=3DinvP8 R8=3DinvP(id=3D9) R9=3Dmap_value(id=3D0,off=3D188,ks=
=3D4,vs=3D23040,umax_value=3D528,var_off=3D(0x0; 0x7ff),s32_max_value=3D204=
7,u32_max_value=3D2047) R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3D=
mmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmap_value fp-48=3Dmap_value fp-56=3DinvP10
# ; if (cgroup_node =3D=3D cgroup_root_node)
# 456: (79) r1 =3D *(u64 *)(r10 -24)
# 457: (5d) if r8 !=3D r1 goto pc+5
#  frame1: R0_w=3DinvP(id=3D10,smax_value=3D256) R1_w=3DinvP(id=3D0) R6_w=
=3DinvP(id=3D10,smax_value=3D256) R7=3DinvP8 R8=3DinvP(id=3D9) R9=3Dmap_val=
ue(id=3D0,off=3D188,ks=3D4,vs=3D23040,umax_value=3D528,var_off=3D(0x0; 0x7f=
f),s32_max_value=3D2047,u32_max_value=3D2047) R10=3Dfp0 fp-8=3Dmmmmmmmm fp-=
16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmap_value fp-48=3Dm=
ap_value fp-56=3DinvP10
# ; *root_pos =3D payload - payload_start;
# 458: (bf) r1 =3D r9
# 459: (79) r2 =3D *(u64 *)(r10 -48)
# 460: (1f) r1 -=3D r2
# ; *root_pos =3D payload - payload_start;
# 461: (79) r2 =3D *(u64 *)(r10 -40)
# 462: (63) *(u32 *)(r2 +40) =3D r1
#  frame1: R0_w=3DinvP(id=3D10,smax_value=3D256) R1_w=3DinvP(id=3D0) R2_w=
=3Dmap_value(id=3D0,off=3D64,ks=3D4,vs=3D23040,imm=3D0) R6_w=3DinvP(id=3D10=
,smax_value=3D256) R7=3DinvP8 R8=3DinvP(id=3D9) R9=3Dmap_value(id=3D0,off=
=3D188,ks=3D4,vs=3D23040,umax_value=3D528,var_off=3D(0x0; 0x7ff),s32_max_va=
lue=3D2047,u32_max_value=3D2047) R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm=
 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmap_value fp-48=3Dmap_value fp-5=
6=3DinvP10
# 463: (b7) r1 =3D 48
# 464: (0f) r8 +=3D r1
# 465: (bf) r1 =3D r10
# ;=20
# 466: (07) r1 +=3D -8
# ; cgroup_node =3D BPF_CORE_READ(cgroup_node, parent);
# 467: (b7) r2 =3D 8
# 468: (bf) r3 =3D r8
# 469: (85) call bpf_probe_read_kernel#113
# 470: (bf) r1 =3D r9
# 471: (0f) r1 +=3D r6
# math between map_value pointer and register with unbounded min value is n=
ot allowed
# processed 346 insns (limit 1000000) max_states_per_insn 0 total_states 26=
 peak_states 26 mark_read 13
#=20
# libbpf: -- END LOG --
# libbpf: failed to load program 'kprobe__proc_sys_write'
# libbpf: failed to load object 'profiler2'
# libbpf: failed to load BPF skeleton 'profiler2': -4007
# test_test_profiler:FAIL:profiler2_skel_load profiler2 skeleton failed
# #110 test_profiler:FAIL
# #111 tp_attach_query:OK
# #112 trace_ext:OK
# #113 trace_printk:OK
# #114 trampoline_count:OK
# #115 udp_limit:OK
# #116 varlen:OK
# #117 vmlinux:OK
# #118 xdp:OK
# #119/1 xdp_adjust_tail_shrink:OK
# #119/2 xdp_adjust_tail_grow:OK
# #119/3 xdp_adjust_tail_grow2:OK
# #119 xdp_adjust_tail:OK
# #120 xdp_attach:OK
# #121 xdp_bpf2bpf:OK
# #122/1 cpumap_with_progs:OK
# #122 xdp_cpumap_attach:OK
# #123/1 DEVMAP with programs in entries:OK
# #123/2 Verifier check of DEVMAP programs:OK
# #123 xdp_devmap_attach:OK
# #124 xdp_info:OK
# #125 xdp_link:OK
# #126 xdp_noinline:OK
# #127 xdp_perf:OK
# Summary: 122/859 PASSED, 1 SKIPPED, 4 FAILED
not ok 18 selftests: bpf: test_progs-no_alu32 # exit=3D1
# selftests: bpf: test_current_pid_tgid_new_ns
# libbpf: Error in bpf_create_map_xattr(test_ns_.bss):Operation not permitt=
ed(-1). Retrying without BTF.
# libbpf: map 'test_ns_.bss': failed to create: Operation not permitted(-1)
# libbpf: permission error while running as root; try raising 'ulimit -l'? =
current value: 64.0 KiB
# libbpf: failed to load object 'test_ns_current_pid_tgid.o'
# Testing bpf_get_ns_current_pid_tgid helper in new ns
# main:PASS:unshare CLONE_NEWPID | CLONE_NEWNS
# main:PASS:Unmounting proc
# main:PASS:Mounting proc
# main:PASS:obj_open
# main:FAIL:obj_load err -1 errno 1
# Testing bpf_get_ns_current_pid_tgid helper in new ns
# main:PASS:unshare CLONE_NEWPID | CLONE_NEWNS
# Testing bpf_get_ns_current_pid_tgid helper in new ns
# main:PASS:unshare CLONE_NEWPID | CLONE_NEWNS
ok 19 selftests: bpf: test_current_pid_tgid_new_ns
# selftests: bpf: urandom_read
ok 20 selftests: bpf: urandom_read
# selftests: bpf: test_kmod.sh
# sysctl: setting key "net.core.bpf_jit_enable": Invalid argument
# [ JIT enabled:0 hardened:0 ]
# [  558.177267] test_bpf: Summary: 378 PASSED, 0 FAILED, [365/365 JIT'ed]
# [  558.178522] test_bpf: test_skb_segment: Summary: 2 PASSED, 0 FAILED
# [ JIT enabled:1 hardened:0 ]
# [  558.535054] test_bpf: Summary: 378 PASSED, 0 FAILED, [365/365 JIT'ed]
# [  558.536289] test_bpf: test_skb_segment: Summary: 2 PASSED, 0 FAILED
# [ JIT enabled:1 hardened:1 ]
# [  558.887127] test_bpf: Summary: 378 PASSED, 0 FAILED, [365/365 JIT'ed]
# [  558.888349] test_bpf: test_skb_segment: Summary: 2 PASSED, 0 FAILED
# [ JIT enabled:1 hardened:2 ]
# [  562.582732] test_bpf: Summary: 378 PASSED, 0 FAILED, [365/365 JIT'ed]
# [  562.583953] test_bpf: test_skb_segment: Summary: 2 PASSED, 0 FAILED
ok 21 selftests: bpf: test_kmod.sh
# selftests: bpf: test_xdp_redirect.sh
# selftests: test_xdp_redirect xdpgeneric [PASS]
# selftests: test_xdp_redirect xdpdrv [PASS]
ok 22 selftests: bpf: test_xdp_redirect.sh
# selftests: bpf: test_xdp_meta.sh
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2047
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 880
# str_off: 880
# str_len: 1143
# btf_total_size: 2047
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D25
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D26
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 ctx)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC ing_cls type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC ing_xdp type_id=3D19
# [21] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [22] ARRAY (anon) type_id=3D21 index_type_id=3D6 nr_elems=3D4
# [23] VAR _license type_id=3D22 linkage=3D1
# [24] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2047
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 880
# str_off: 880
# str_len: 1143
# btf_total_size: 2047
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D25
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D26
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 ctx)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC ing_cls type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC ing_xdp type_id=3D19
# [21] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [22] ARRAY (anon) type_id=3D21 index_type_id=3D6 nr_elems=3D4
# [23] VAR _license type_id=3D22 linkage=3D1
# [24] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2047
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 880
# str_off: 880
# str_len: 1143
# btf_total_size: 2047
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D25
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D26
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 ctx)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC ing_cls type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC ing_xdp type_id=3D19
# [21] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [22] ARRAY (anon) type_id=3D21 index_type_id=3D6 nr_elems=3D4
# [23] VAR _license type_id=3D22 linkage=3D1
# [24] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2047
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 880
# str_off: 880
# str_len: 1143
# btf_total_size: 2047
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D25
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D26
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 ctx)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC ing_cls type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC ing_xdp type_id=3D19
# [21] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [22] ARRAY (anon) type_id=3D21 index_type_id=3D6 nr_elems=3D4
# [23] VAR _license type_id=3D22 linkage=3D1
# [24] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.22 (10.1.1.22) 56(84) bytes of data.
# 64 bytes from 10.1.1.22: icmp_seq=3D1 ttl=3D64 time=3D0.045 ms
#=20
# --- 10.1.1.22 ping statistics ---
# 1 packets transmitted, 1 received, 0% packet loss, time 0ms
# rtt min/avg/max/mdev =3D 0.045/0.045/0.045/0.000 ms
# PING 10.1.1.11 (10.1.1.11) 56(84) bytes of data.
# 64 bytes from 10.1.1.11: icmp_seq=3D1 ttl=3D64 time=3D0.025 ms
#=20
# --- 10.1.1.11 ping statistics ---
# 1 packets transmitted, 1 received, 0% packet loss, time 0ms
# rtt min/avg/max/mdev =3D 0.025/0.025/0.025/0.000 ms
# selftests: test_xdp_meta [PASS]
ok 23 selftests: bpf: test_xdp_meta.sh
# selftests: bpf: test_xdp_veth.sh
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       620
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 328
# btf_total_size: 620
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_dummy_prog type_id=3D5
# [8] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [9] ARRAY (anon) type_id=3D8 index_type_id=3D10 nr_elems=3D4
# [10] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [11] VAR _license type_id=3D9 linkage=3D1
# [12] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       600
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 308
# btf_total_size: 600
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 xdp)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_tx type_id=3D5
# [8] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [9] ARRAY (anon) type_id=3D8 index_type_id=3D10 nr_elems=3D4
# [10] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [11] VAR _license type_id=3D9 linkage=3D1
# [12] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       620
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 268
# str_off: 268
# str_len: 328
# btf_total_size: 620
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_dummy_prog type_id=3D5
# [8] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [9] ARRAY (anon) type_id=3D8 index_type_id=3D10 nr_elems=3D4
# [10] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [11] VAR _license type_id=3D9 linkage=3D1
# [12] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.33 (10.1.1.33) 56(84) bytes of data.
# 64 bytes from 10.1.1.33: icmp_seq=3D1 ttl=3D64 time=3D0.049 ms
#=20
# --- 10.1.1.33 ping statistics ---
# 1 packets transmitted, 1 received, 0% packet loss, time 0ms
# rtt min/avg/max/mdev =3D 0.049/0.049/0.049/0.000 ms
# selftests: xdp_veth [PASS]
ok 24 selftests: bpf: test_xdp_veth.sh
# selftests: bpf: test_offload.py
# Test destruction of generic XDP...
# Test TC non-offloaded...
# Test TC non-offloaded isn't getting bound...
# Test TC offloads are off by default...
# Test TC offload by default...
# Test TC cBPF bytcode tries offload by default...
# Test TC cBPF unbound bytecode doesn't offload...
# Test non-0 chain offload...
# Test TC replace...
# Test TC replace bad flags...
# Test spurious extack from the driver...
# Test TC offloads work...
# FAIL: Missing or incorrect message from netdevsim in verifier log
#   File "./test_offload.py", line 920, in <module>
#     check_verifier_log(err, "[netdevsim] Hello from netdevsim!")
#   File "./test_offload.py", line 671, in check_verifier_log
#     fail(True, "Missing or incorrect message from netdevsim in verifier l=
og")
#   File "./test_offload.py", line 86, in fail
#     tb =3D "".join(traceback.extract_stack().format())
#=20
not ok 25 selftests: bpf: test_offload.py # exit=3D1
# selftests: bpf: test_sock_addr.sh
# Wait for testing IPv4/IPv6 to become available ... OK
# libbpf: elf: skipping unrecognized data section(7) .rodata.str1.1
# libbpf: elf: skipping unrecognized data section(8) .rodata.cst16
# libbpf: load bpf program failed: Permission denied
# libbpf: -- BEGIN DUMP LOG ---
# libbpf:=20
# Func#2 is safe for any args that match its prototype
# ; int connect_v4_prog(struct bpf_sock_addr *ctx)
# 0: (bf) r7 =3D r1
# 1: (b4) w6 =3D 0
# ; memset(&tuple.ipv4.saddr, 0, sizeof(tuple.ipv4.saddr));
# 2: (63) *(u32 *)(r10 -72) =3D r6
# 3: (b7) r1 =3D 0
# 4: (7b) *(u64 *)(r10 -96) =3D r1
# 5: (b4) w2 =3D 23569
# ; tuple.ipv4.dport =3D bpf_htons(DST_REWRITE_PORT4);
# 6: (6b) *(u16 *)(r10 -94) =3D r2
# ; memset(&tuple.ipv4.saddr, 0, sizeof(tuple.ipv4.saddr));
# 7: (7b) *(u64 *)(r10 -104) =3D r1
# 8: (b4) w2 =3D 16777343
# ; tuple.ipv4.daddr =3D bpf_htonl(DST_REWRITE_IP4);
# 9: (63) *(u32 *)(r10 -100) =3D r2
# ; memset(&tuple.ipv4.saddr, 0, sizeof(tuple.ipv4.saddr));
# 10: (7b) *(u64 *)(r10 -80) =3D r1
# 11: (7b) *(u64 *)(r10 -88) =3D r1
# 12: (18) r2 =3D 0x31726464615f6b
# ; char veth1[IFNAMSIZ] =3D "test_sock_addr1";
# 14: (7b) *(u64 *)(r10 -8) =3D r2
# 15: (18) r2 =3D 0x636f735f74736574
# 17: (7b) *(u64 *)(r10 -16) =3D r2
# 18: (18) r3 =3D 0x32726464615f6b
# ; char veth2[IFNAMSIZ] =3D "test_sock_addr2";
# 20: (7b) *(u64 *)(r10 -24) =3D r3
# 21: (7b) *(u64 *)(r10 -32) =3D r2
# 22: (18) r2 =3D 0x7665645f746e65
# ; char missing[IFNAMSIZ] =3D "nonexistent_dev";
# 24: (7b) *(u64 *)(r10 -40) =3D r2
# 25: (18) r2 =3D 0x74736978656e6f6e
# 27: (7b) *(u64 *)(r10 -48) =3D r2
# ; char del_bind[IFNAMSIZ] =3D "";
# 28: (7b) *(u64 *)(r10 -56) =3D r1
# 29: (7b) *(u64 *)(r10 -64) =3D r1
# 30: (bf) r4 =3D r10
# ;=20
# 31: (07) r4 +=3D -16
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 32: (bf) r1 =3D r7
# 33: (b4) w2 =3D 1
# 34: (b4) w3 =3D 25
# 35: (b4) w5 =3D 16
# 36: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 37: (55) if r0 !=3D 0x0 goto pc+78
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R10=3Dfp0 fp-8=3D=
mmmmmmmm fp-16=3Dmmmmmmmm fp-24=3DinvP14199524341931883 fp-32=3DinvP7165072=
385982555508 fp-40=3DinvP33325529024458341 fp-48=3DinvP8391166496540094318 =
fp-56=3D00000000 fp-64=3D00000000 fp-72=3D????0000 fp-80=3D00000000 fp-88=
=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 38: (bf) r4 =3D r10
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 39: (07) r4 +=3D -32
# 40: (bf) r1 =3D r7
# 41: (b4) w2 =3D 1
# 42: (b4) w3 =3D 25
# 43: (b4) w5 =3D 16
# 44: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 45: (55) if r0 !=3D 0x0 goto pc+70
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R10=3Dfp0 fp-8=3D=
mmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3DinvP333=
25529024458341 fp-48=3DinvP8391166496540094318 fp-56=3D00000000 fp-64=3D000=
00000 fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 f=
p-104=3Dmmmm0000
# 46: (bf) r4 =3D r10
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 47: (07) r4 +=3D -48
# 48: (bf) r1 =3D r7
# 49: (b4) w2 =3D 1
# 50: (b4) w3 =3D 25
# 51: (b4) w5 =3D 16
# 52: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 53: (55) if r0 !=3D 0xffffffed goto pc+62
#  R0=3DinvP-19 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R10=3Dfp0 fp-8=
=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmm=
mmmm fp-48=3Dmmmmmmmm fp-56=3D00000000 fp-64=3D00000000 fp-72=3D????0000 fp=
-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 54: (b4) w8 =3D 1
# 55: (bf) r4 =3D r10
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_BINDTODEVICE,
# 56: (07) r4 +=3D -64
# 57: (bf) r1 =3D r7
# 58: (b4) w2 =3D 1
# 59: (b4) w3 =3D 25
# 60: (b4) w5 =3D 16
# 61: (85) call bpf_setsockopt#49
# ; if (bind_to_device(ctx))
# 62: (55) if r0 !=3D 0x0 goto pc+53
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 63: (b4) w6 =3D 0
# ; int zero =3D 0, one =3D 1;
# 64: (63) *(u32 *)(r10 -16) =3D r6
# ; int zero =3D 0, one =3D 1;
# 65: (63) *(u32 *)(r10 -32) =3D r8
# 66: (bf) r4 =3D r10
# ;=20
# 67: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_KEEPALIVE, &one, sizeof(one)))
# 68: (bf) r1 =3D r7
# 69: (b4) w2 =3D 1
# 70: (b4) w3 =3D 9
# 71: (b4) w5 =3D 4
# 72: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_KEEPALIVE, &one, sizeof(one)))
# 73: (55) if r0 !=3D 0x0 goto pc+42
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# ; if (ctx->type =3D=3D SOCK_STREAM) {
# 74: (61) r1 =3D *(u32 *)(r7 +32)
# ; if (ctx->type =3D=3D SOCK_STREAM) {
# 75: (56) if w1 !=3D 0x1 goto pc+42
#  R0=3DinvP0 R1_w=3DinvP1 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=
=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp=
-104=3Dmmmm0000
# 76: (bf) r4 =3D r10
# ;=20
# 77: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPIDLE, &one, sizeof(one)))
# 78: (bf) r1 =3D r7
# 79: (b4) w2 =3D 6
# 80: (b4) w3 =3D 4
# 81: (b4) w5 =3D 4
# 82: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPIDLE, &one, sizeof(one)))
# 83: (55) if r0 !=3D 0x0 goto pc+32
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 84: (bf) r4 =3D r10
# ;=20
# 85: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPINTVL, &one, sizeof(one)))
# 86: (bf) r1 =3D r7
# 87: (b4) w2 =3D 6
# 88: (b4) w3 =3D 5
# 89: (b4) w5 =3D 4
# 90: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPINTVL, &one, sizeof(one)))
# 91: (55) if r0 !=3D 0x0 goto pc+24
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 92: (bf) r4 =3D r10
# ;=20
# 93: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPCNT, &one, sizeof(one)))
# 94: (bf) r1 =3D r7
# 95: (b4) w2 =3D 6
# 96: (b4) w3 =3D 6
# 97: (b4) w5 =3D 4
# 98: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_KEEPCNT, &one, sizeof(one)))
# 99: (55) if r0 !=3D 0x0 goto pc+16
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 100: (bf) r4 =3D r10
# ;=20
# 101: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_SYNCNT, &one, sizeof(one)))
# 102: (bf) r1 =3D r7
# 103: (b4) w2 =3D 6
# 104: (b4) w3 =3D 7
# 105: (b4) w5 =3D 4
# 106: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_SYNCNT, &one, sizeof(one)))
# 107: (55) if r0 !=3D 0x0 goto pc+8
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 108: (bf) r4 =3D r10
# ;=20
# 109: (07) r4 +=3D -32
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_USER_TIMEOUT, &one, sizeof(one)))
# 110: (bf) r1 =3D r7
# 111: (b4) w2 =3D 6
# 112: (b4) w3 =3D 18
# 113: (b4) w5 =3D 4
# 114: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_USER_TIMEOUT, &one, sizeof(one)))
# 115: (15) if r0 =3D=3D 0x0 goto pc+2
#=20
# from 115 to 118: R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R=
8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmm0000 fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp=
-104=3Dmmmm0000
# 118: (bf) r4 =3D r10
# ;=20
# 119: (07) r4 +=3D -16
# ; if (bpf_setsockopt(ctx, SOL_SOCKET, SO_KEEPALIVE, &zero, sizeof(zero)))
# 120: (bf) r1 =3D r7
# 121: (b4) w2 =3D 1
# 122: (b4) w3 =3D 9
# 123: (b4) w5 =3D 4
# 124: (85) call bpf_setsockopt#49
# ; if (set_keepalive(ctx))
# 125: (55) if r0 !=3D 0x0 goto pc-10
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 126: (b4) w1 =3D 65535
# ; int lowat =3D 65535;
# 127: (63) *(u32 *)(r10 -16) =3D r1
# ; if (ctx->type =3D=3D SOCK_STREAM) {
# 128: (61) r1 =3D *(u32 *)(r7 +32)
# ; if (ctx->type =3D=3D SOCK_STREAM) {
# 129: (56) if w1 !=3D 0x1 goto pc+10
#  R0=3DinvP0 R1_w=3DinvP1 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=
=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp=
-104=3Dmmmm0000
# 130: (bf) r4 =3D r10
# ;=20
# 131: (07) r4 +=3D -16
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_NOTSENT_LOWAT, &lowat, sizeof(lowa=
t)))
# 132: (bf) r1 =3D r7
# 133: (b4) w2 =3D 6
# 134: (b4) w3 =3D 25
# 135: (b4) w5 =3D 4
# 136: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_NOTSENT_LOWAT, &lowat, sizeof(lowa=
t)))
# 137: (15) if r0 =3D=3D 0x0 goto pc+1
#=20
# from 137 to 139: R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R=
8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp=
-104=3Dmmmm0000
# ; if (ctx->type !=3D SOCK_STREAM && ctx->type !=3D SOCK_DGRAM)
# 139: (61) r1 =3D *(u32 *)(r7 +32)
# ; if (ctx->type !=3D SOCK_STREAM && ctx->type !=3D SOCK_DGRAM)
# 140: (bc) w2 =3D w1
# 141: (04) w2 +=3D -1
# 142: (26) if w2 > 0x1 goto pc-27
#  R0=3DinvP0 R1_w=3DinvP(id=3D0,umax_value=3D4294967295,var_off=3D(0x0; 0x=
ffffffff)) R2_w=3DinvP(id=3D0,umax_value=3D1,var_off=3D(0x0; 0x1)) R6=3Dinv=
P0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp=
-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dm=
mmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp-80=3D00000000=
 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# ; else if (ctx->type =3D=3D SOCK_STREAM)
# 143: (56) if w1 !=3D 0x1 goto pc+8
#  R0=3DinvP0 R1=3DinvP1 R2=3DinvP(id=3D0,umax_value=3D1,var_off=3D(0x0; 0x=
1)) R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=
=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmm=
mmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp=
-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mm00 fp-104=3Dmmmm0000
# 144: (bf) r2 =3D r10
# ; sk =3D bpf_sk_lookup_tcp(ctx, &tuple, sizeof(tuple.ipv4),
# 145: (07) r2 +=3D -104
# 146: (bf) r1 =3D r7
# 147: (b4) w3 =3D 12
# 148: (b7) r4 =3D -1
# 149: (b7) r5 =3D 0
# 150: (85) call bpf_sk_lookup_tcp#84
# 151: (05) goto pc+7
# ; if (!sk)
# 159: (15) if r0 =3D=3D 0x0 goto pc-44
#  R0=3Dsock(id=3D0,ref_obj_id=3D3,off=3D0,imm=3D0) R6=3DinvP0 R7=3Dctx(id=
=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm=
 fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=
=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D0000=
0000 fp-96=3D0000mmmm fp-104=3Dmmmmmmmm refs=3D3
# ; if (sk->src_ip4 !=3D tuple.ipv4.daddr ||
# 160: (61) r1 =3D *(u32 *)(r0 +24)
# ; if (sk->src_ip4 !=3D tuple.ipv4.daddr ||
# 161: (61) r2 =3D *(u32 *)(r10 -100)
# ; if (sk->src_ip4 !=3D tuple.ipv4.daddr ||
# 162: (5e) if w1 !=3D w2 goto pc+2
#  R0=3Dsock(id=3D0,ref_obj_id=3D3,off=3D0,imm=3D0) R1_w=3DinvP(id=3D0,umax=
_value=3D4294967295,var_off=3D(0x0; 0xffffffff)) R2_w=3DinvP(id=3D0,umax_va=
lue=3D4294967295,var_off=3D(0x0; 0xffffffff)) R6=3DinvP0 R7=3Dctx(id=3D0,of=
f=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=
=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmm=
mmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp=
-96=3D0000mmmm fp-104=3Dmmmmmmmm refs=3D3
# ; sk->src_port !=3D DST_REWRITE_PORT4) {
# 163: (61) r1 =3D *(u32 *)(r0 +44)
# ; if (sk->src_ip4 !=3D tuple.ipv4.daddr ||
# 164: (16) if w1 =3D=3D 0x115c goto pc+3
#=20
# from 164 to 168: R0=3Dsock(id=3D0,ref_obj_id=3D3,off=3D0,imm=3D0) R1_w=3D=
invP4444 R2_w=3DinvP(id=3D0,umax_value=3D4294967295,var_off=3D(0x0; 0xfffff=
fff)) R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=
=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmm=
mmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp=
-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=3Dmmmmmmmm refs=3D3
# ; bpf_sk_release(sk);
# 168: (bf) r1 =3D r0
# 169: (85) call bpf_sk_release#86
# ; if (ctx->type =3D=3D SOCK_STREAM && set_cc(ctx))
# 170: (61) r1 =3D *(u32 *)(r7 +32)
# ; if (ctx->type =3D=3D SOCK_STREAM && set_cc(ctx))
# 171: (56) if w1 !=3D 0x1 goto pc+35
#  R0_w=3DinvP(id=3D0) R1_w=3DinvP1 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=
=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmm=
m fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=
=3Dmmmmmmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000=
mmmm fp-104=3Dmmmmmmmm
# 172: (b7) r1 =3D 1869505906
# ; char reno[TCP_CA_NAME_MAX] =3D "reno";
# 173: (7b) *(u64 *)(r10 -16) =3D r1
# 174: (b7) r1 =3D 0
# 175: (7b) *(u64 *)(r10 -8) =3D r1
# ; char cubic[TCP_CA_NAME_MAX] =3D "cubic";
# 176: (7b) *(u64 *)(r10 -24) =3D r1
# 177: (18) r1 =3D 0x6369627563
# 179: (7b) *(u64 *)(r10 -32) =3D r1
# 180: (bf) r4 =3D r10
# ;=20
# 181: (07) r4 +=3D -16
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_CONGESTION, &reno, sizeof(reno)))
# 182: (bf) r1 =3D r7
# 183: (b4) w2 =3D 6
# 184: (b4) w3 =3D 13
# 185: (b4) w5 =3D 16
# 186: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_CONGESTION, &reno, sizeof(reno)))
# 187: (55) if r0 !=3D 0x0 goto pc+13
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3D00000000 fp-32=3DinvP426969822=
563 fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-=
72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=3Dm=
mmmmmmm
# 188: (bf) r2 =3D r10
# ; if (verify_cc(ctx, reno))
# 189: (07) r2 +=3D -16
# 190: (bf) r1 =3D r7
# 191: (85) call pc+25
# arg#1 type is not a struct
# Unrecognized arg#1 type PTR
# caller:
#  R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3D=
mmmmmmmm fp-16=3Dmmmmmmmm fp-24=3D00000000 fp-32=3DinvP426969822563 fp-40=
=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????=
0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=3Dmmmmmmmm
# callee:
#  frame1: R1_w=3Dctx(id=3D0,off=3D0,imm=3D0) R2_w=3Dfp-16 R10=3Dfp0
# ; static __inline int verify_cc(struct bpf_sock_addr *ctx,
# 217: (bf) r6 =3D r2
# 218: (bf) r4 =3D r10
# ;=20
# 219: (07) r4 +=3D -16
# ; if (bpf_getsockopt(ctx, SOL_TCP, TCP_CONGESTION, &buf, sizeof(buf)))
# 220: (b4) w2 =3D 6
# 221: (b4) w3 =3D 13
# 222: (b4) w5 =3D 16
# 223: (85) call bpf_getsockopt#57
# 224: (bf) r1 =3D r0
# 225: (b4) w0 =3D 1
# ; if (bpf_getsockopt(ctx, SOL_TCP, TCP_CONGESTION, &buf, sizeof(buf)))
# 226: (55) if r1 !=3D 0x0 goto pc+7
#  frame1: R0_w=3DinvP1 R1_w=3DinvP0 R6=3Dfp-16 R10=3Dfp0 fp-8=3Dmmmmmmmm f=
p-16=3Dmmmmmmmm
# ; if (buf[i] !=3D expected[i])
# 227: (71) r2 =3D *(u8 *)(r6 +0)
# ; if (buf[i] !=3D expected[i])
# 228: (71) r1 =3D *(u8 *)(r10 -16)
# ;=20
# 229: (b4) w0 =3D 1
# ; if (buf[i] !=3D expected[i])
# 230: (1e) if w1 =3D=3D w2 goto pc+1
#=20
# from 230 to 232: frame1: R0_w=3DinvP1 R1_w=3DinvP(id=3D0,umax_value=3D255=
,var_off=3D(0x0; 0xff)) R2_w=3DinvP(id=3D0,umax_value=3D255,var_off=3D(0x0;=
 0xff)) R6=3Dfp-16 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# ;=20
# 232: (b4) w0 =3D 0
# ; if (buf[i] =3D=3D 0)
# 233: (56) if w1 !=3D 0x0 goto pc+1
#  frame1: R0_w=3DinvP0 R1_w=3DinvP0 R2_w=3DinvP(id=3D0,umax_value=3D255,va=
r_off=3D(0x0; 0xff)) R6=3Dfp-16 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# ; }
# 234: (95) exit
# returning from callee:
#  frame1: R0_w=3DinvP0 R1_w=3DinvP0 R2_w=3DinvP(id=3D0,umax_value=3D255,va=
r_off=3D(0x0; 0xff)) R6=3Dfp-16 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# to caller at 192:
#  R0_w=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=
=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3D00000000 fp-32=3DinvP426969=
822563 fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm =
fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=
=3Dmmmmmmmm
#=20
# from 234 to 192: R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R=
8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3D00000000 fp-32=
=3DinvP426969822563 fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-6=
4=3Dmmmmmmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D000=
0mmmm fp-104=3Dmmmmmmmm
# ; if (verify_cc(ctx, reno))
# 192: (56) if w0 !=3D 0x0 goto pc+8
# 193: (bf) r4 =3D r10
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_CONGESTION, &cubic, sizeof(cubic)))
# 194: (07) r4 +=3D -32
# 195: (bf) r1 =3D r7
# 196: (b4) w2 =3D 6
# 197: (b4) w3 =3D 13
# 198: (b4) w5 =3D 16
# 199: (85) call bpf_setsockopt#49
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_CONGESTION, &cubic, sizeof(cubic)))
# 200: (15) if r0 =3D=3D 0x0 goto pc+1
#=20
# from 200 to 202: R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R=
8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp=
-104=3Dmmmmmmmm
# ; if (bpf_setsockopt(ctx, SOL_TCP, TCP_CONGESTION, &cubic, sizeof(cubic)))
# 202: (bf) r2 =3D r10
# ; if (verify_cc(ctx, cubic))
# 203: (07) r2 +=3D -32
# 204: (bf) r1 =3D r7
# 205: (85) call pc+11
# caller:
#  R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3Dfp0 fp-8=3D=
mmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmm=
m fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D????0000 fp-80=
=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=3Dmmmmmmmm
# callee:
#  frame1: R1_w=3Dctx(id=3D0,off=3D0,imm=3D0) R2_w=3Dfp-32 R10=3Dfp0
# ; static __inline int verify_cc(struct bpf_sock_addr *ctx,
# 217: (bf) r6 =3D r2
# 218: (bf) r4 =3D r10
# ;=20
# 219: (07) r4 +=3D -16
# ; if (bpf_getsockopt(ctx, SOL_TCP, TCP_CONGESTION, &buf, sizeof(buf)))
# 220: (b4) w2 =3D 6
# 221: (b4) w3 =3D 13
# 222: (b4) w5 =3D 16
# 223: (85) call bpf_getsockopt#57
# 224: (bf) r1 =3D r0
# 225: (b4) w0 =3D 1
# ; if (bpf_getsockopt(ctx, SOL_TCP, TCP_CONGESTION, &buf, sizeof(buf)))
# 226: (55) if r1 !=3D 0x0 goto pc+7
#  frame1: R0_w=3DinvP1 R1_w=3DinvP0 R6_w=3Dfp-32 R10=3Dfp0 fp-8=3Dmmmmmmmm=
 fp-16=3Dmmmmmmmm
# ; if (buf[i] !=3D expected[i])
# 227: (71) r2 =3D *(u8 *)(r6 +0)
# ; if (buf[i] !=3D expected[i])
# 228: (71) r1 =3D *(u8 *)(r10 -16)
# ;=20
# 229: (b4) w0 =3D 1
# ; if (buf[i] !=3D expected[i])
# 230: (1e) if w1 =3D=3D w2 goto pc+1
#=20
# from 230 to 232: frame1: R0=3DinvP1 R1=3DinvP(id=3D0,umax_value=3D255,var=
_off=3D(0x0; 0xff)) R2=3DinvP(id=3D0,umax_value=3D255,var_off=3D(0x0; 0xff)=
) R6=3Dfp-32 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# ;=20
# 232: (b4) w0 =3D 0
# ; if (buf[i] =3D=3D 0)
# 233: (56) if w1 !=3D 0x0 goto pc+1
#  frame1: R0_w=3DinvP0 R1=3DinvP0 R2=3DinvP(id=3D0,umax_value=3D255,var_of=
f=3D(0x0; 0xff)) R6=3Dfp-32 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# ; }
# 234: (95) exit
# returning from callee:
#  frame1: R0=3DinvP0 R1=3DinvP0 R2=3DinvP(id=3D0,umax_value=3D255,var_off=
=3D(0x0; 0xff)) R6=3Dfp-32 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm
# to caller at 206:
#  R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R8=3DinvP1 R10=3D=
fp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-4=
0=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmmmmmm fp-72=3D???=
?0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp-104=3Dmmmmmmmm
#=20
# from 234 to 206: R0=3DinvP0 R6=3DinvP0 R7=3Dctx(id=3D0,off=3D0,imm=3D0) R=
8=3DinvP1 R10=3Dfp0 fp-8=3Dmmmmmmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm fp-48=3Dmmmmmmmm fp-56=3Dmmmmmmmm fp-64=3Dmmmm=
mmmm fp-72=3D????0000 fp-80=3D00000000 fp-88=3D00000000 fp-96=3D0000mmmm fp=
-104=3Dmmmmmmmm
# ; if (ctx->type =3D=3D SOCK_STREAM && set_cc(ctx))
# 206: (56) if w0 !=3D 0x0 goto pc-91
# 207: (b4) w1 =3D 23569
# ; ctx->user_port =3D bpf_htons(DST_REWRITE_PORT4);
# 208: (63) *(u32 *)(r7 +24) =3D r1
# 209: (b4) w1 =3D 16777343
# ; ctx->user_ip4 =3D bpf_htonl(DST_REWRITE_IP4);
# 210: (63) *(u32 *)(r7 +4) =3D r1
# invalid bpf_context access off=3D4 size=3D4
# processed 263 insns (limit 1000000) max_states_per_insn 1 total_states 24=
 peak_states 24 mark_read 13
#=20
# libbpf: -- END LOG --
# libbpf: failed to load program 'connect_v4_prog'
# libbpf: failed to load object './connect4_prog.o'
# libbpf: elf: skipping unrecognized data section(7) .rodata.str1.1
# libbpf: elf: skipping unrecognized data section(8) .rodata.cst16
# libbpf: elf: skipping unrecognized data section(7) .rodata.str1.1
# libbpf: elf: skipping unrecognized data section(8) .rodata.cst16
# libbpf: elf: skipping unrecognized data section(7) .rodata.str1.1
# libbpf: elf: skipping unrecognized data section(8) .rodata.cst16
# libbpf: load bpf program failed: Permission denied
# libbpf: -- BEGIN DUMP LOG ---
# libbpf:=20
# ; int connect_v6_prog(struct bpf_sock_addr *ctx)
# 0: (bf) r6 =3D r1
# 1: (18) r1 =3D 0x100000000000000
# ; tuple.ipv6.daddr[0] =3D bpf_htonl(DST_REWRITE_IP6_0);
# 3: (7b) *(u64 *)(r10 -16) =3D r1
# 4: (b7) r1 =3D 0
# 5: (7b) *(u64 *)(r10 -24) =3D r1
# last_idx 5 first_idx 0
# regs=3D2 stack=3D0 before 4: (b7) r1 =3D 0
# 6: (7b) *(u64 *)(r10 -32) =3D r1
# 7: (7b) *(u64 *)(r10 -40) =3D r1
# 8: (b4) w1 =3D 169476096
# ; memset(&tuple.ipv6.sport, 0, sizeof(tuple.ipv6.sport));
# 9: (63) *(u32 *)(r10 -8) =3D r1
# 10: (b4) w7 =3D 0
# ; if (ctx->type !=3D SOCK_STREAM && ctx->type !=3D SOCK_DGRAM)
# 11: (61) r1 =3D *(u32 *)(r6 +32)
# ; if (ctx->type !=3D SOCK_STREAM && ctx->type !=3D SOCK_DGRAM)
# 12: (bc) w2 =3D w1
# 13: (04) w2 +=3D -1
# 14: (26) if w2 > 0x1 goto pc+33
#  R1_w=3Dinv(id=3D0,umax_value=3D4294967295,var_off=3D(0x0; 0xffffffff)) R=
2_w=3Dinv(id=3D0,umax_value=3D1,var_off=3D(0x0; 0x1)) R6_w=3Dctx(id=3D0,off=
=3D0,imm=3D0) R7_w=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16_w=3Dinv7205759403=
7927936 fp-24_w=3D00000000 fp-32_w=3D00000000 fp-40_w=3D00000000
# ; else if (ctx->type =3D=3D SOCK_STREAM)
# 15: (56) if w1 !=3D 0x1 goto pc+8
#  R1_w=3Dinv1 R2_w=3Dinv(id=3D0,umax_value=3D1,var_off=3D(0x0; 0x1)) R6_w=
=3Dctx(id=3D0,off=3D0,imm=3D0) R7_w=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16_=
w=3Dinv72057594037927936 fp-24_w=3D00000000 fp-32_w=3D00000000 fp-40_w=3D00=
000000
# 16: (bf) r2 =3D r10
# ; sk =3D bpf_sk_lookup_tcp(ctx, &tuple, sizeof(tuple.ipv6),
# 17: (07) r2 +=3D -40
# 18: (bf) r1 =3D r6
# 19: (b4) w3 =3D 36
# 20: (b7) r4 =3D -1
# 21: (b7) r5 =3D 0
# 22: (85) call bpf_sk_lookup_tcp#84
# last_idx 22 first_idx 0
# regs=3D8 stack=3D0 before 21: (b7) r5 =3D 0
# regs=3D8 stack=3D0 before 20: (b7) r4 =3D -1
# regs=3D8 stack=3D0 before 19: (b4) w3 =3D 36
# 23: (05) goto pc+7
# ; if (!sk)
# 31: (15) if r0 =3D=3D 0x0 goto pc+16
#  R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R6=3Dctx(id=3D0,off=3D0=
,imm=3D0) R7=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmm=
mmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; if (sk->src_ip6[0] !=3D tuple.ipv6.daddr[0] ||
# 32: (61) r1 =3D *(u32 *)(r0 +28)
# ; if (sk->src_ip6[0] !=3D tuple.ipv6.daddr[0] ||
# 33: (61) r2 =3D *(u32 *)(r10 -24)
# ; if (sk->src_ip6[0] !=3D tuple.ipv6.daddr[0] ||
# 34: (5e) if w1 !=3D w2 goto pc+11
#  R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R1_w=3Dinv(id=3D0,umax_=
value=3D4294967295,var_off=3D(0x0; 0xffffffff)) R2_w=3Dinv(id=3D0,umax_valu=
e=3D4294967295,var_off=3D(0x0; 0xffffffff)) R6=3Dctx(id=3D0,off=3D0,imm=3D0=
) R7=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-=
32=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; sk->src_ip6[1] !=3D tuple.ipv6.daddr[1] ||
# 35: (61) r1 =3D *(u32 *)(r0 +32)
# ; sk->src_ip6[1] !=3D tuple.ipv6.daddr[1] ||
# 36: (61) r2 =3D *(u32 *)(r10 -20)
# ; sk->src_ip6[1] !=3D tuple.ipv6.daddr[1] ||
# 37: (5e) if w1 !=3D w2 goto pc+8
#  R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R1_w=3Dinv(id=3D0,umax_=
value=3D4294967295,var_off=3D(0x0; 0xffffffff)) R2_w=3Dinv(id=3D0,umax_valu=
e=3D4294967295,var_off=3D(0x0; 0xffffffff)) R6=3Dctx(id=3D0,off=3D0,imm=3D0=
) R7=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-=
32=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; sk->src_ip6[2] !=3D tuple.ipv6.daddr[2] ||
# 38: (61) r1 =3D *(u32 *)(r0 +36)
# ; sk->src_ip6[2] !=3D tuple.ipv6.daddr[2] ||
# 39: (61) r2 =3D *(u32 *)(r10 -16)
# ; sk->src_ip6[2] !=3D tuple.ipv6.daddr[2] ||
# 40: (5e) if w1 !=3D w2 goto pc+5
#  R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R1=3Dinv(id=3D0,umax_va=
lue=3D4294967295,var_off=3D(0x0; 0xffffffff)) R2=3Dinv(id=3D0,umax_value=3D=
4294967295,var_off=3D(0x0; 0xffffffff)) R6=3Dctx(id=3D0,off=3D0,imm=3D0) R7=
=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=
=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; sk->src_ip6[3] !=3D tuple.ipv6.daddr[3] ||
# 41: (61) r1 =3D *(u32 *)(r0 +40)
# ; sk->src_ip6[3] !=3D tuple.ipv6.daddr[3] ||
# 42: (61) r2 =3D *(u32 *)(r10 -12)
# ; sk->src_ip6[3] !=3D tuple.ipv6.daddr[3] ||
# 43: (5e) if w1 !=3D w2 goto pc+2
#  R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R1_w=3Dinv(id=3D0,umax_=
value=3D4294967295,var_off=3D(0x0; 0xffffffff)) R2_w=3Dinv(id=3D0,umax_valu=
e=3D4294967295,var_off=3D(0x0; 0xffffffff)) R6=3Dctx(id=3D0,off=3D0,imm=3D0=
) R7=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-16=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-=
32=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; sk->src_port !=3D DST_REWRITE_PORT6) {
# 44: (61) r1 =3D *(u32 *)(r0 +44)
# ; if (sk->src_ip6[0] !=3D tuple.ipv6.daddr[0] ||
# 45: (16) if w1 =3D=3D 0x1a0a goto pc+4
#=20
# from 45 to 50: R0=3Dsock(id=3D0,ref_obj_id=3D2,off=3D0,imm=3D0) R1_w=3Din=
v6666 R2_w=3Dinv(id=3D0,umax_value=3D4294967295,var_off=3D(0x0; 0xffffffff)=
) R6=3Dctx(id=3D0,off=3D0,imm=3D0) R7=3Dinv0 R10=3Dfp0 fp-8=3D????mmmm fp-1=
6=3Dmmmmmmmm fp-24=3Dmmmmmmmm fp-32=3Dmmmmmmmm fp-40=3Dmmmmmmmm refs=3D2
# ; bpf_sk_release(sk);
# 50: (bf) r1 =3D r0
# 51: (85) call bpf_sk_release#86
# 52: (b4) w1 =3D 2586
# ; ctx->user_port =3D bpf_htons(DST_REWRITE_PORT6);
# 53: (63) *(u32 *)(r6 +24) =3D r1
# 54: (18) r1 =3D 0x100000000000000
# ; ctx->user_ip6[2] =3D bpf_htonl(DST_REWRITE_IP6_2);
# 56: (7b) *(u64 *)(r6 +16) =3D r1
# invalid bpf_context access off=3D16 size=3D8
# processed 48 insns (limit 1000000) max_states_per_insn 0 total_states 3 p=
eak_states 3 mark_read 3
#=20
# libbpf: -- END LOG --
# libbpf: failed to load program 'connect_v6_prog'
# libbpf: failed to load object './connect6_prog.o'
# (test_sock_addr.c:1315: errno: Operation not permitted) Fail to send mess=
age to server
# (test_sock_addr.c:1315: errno: Unknown error 524) Fail to send message to=
 server
# (test_sock_addr.c:1315: errno: Operation not permitted) Fail to send mess=
age to server
# Test case: bind4: load prog with wrong expected attach type .. [PASS]
# Test case: bind4: attach prog with wrong attach type .. [PASS]
# Test case: bind4: rewrite IP & TCP port in .. [PASS]
# Test case: bind4: rewrite IP & UDP port in .. [PASS]
# Test case: bind6: load prog with wrong expected attach type .. [PASS]
# Test case: bind6: attach prog with wrong attach type .. [PASS]
# Test case: bind6: rewrite IP & TCP port in .. [PASS]
# Test case: bind6: rewrite IP & UDP port in .. [PASS]
# Test case: connect4: load prog with wrong expected attach type .. [PASS]
# Test case: connect4: attach prog with wrong attach type .. [PASS]
# Test case: connect4: rewrite IP & TCP port .. [PASS]
# Test case: connect4: rewrite IP & UDP port .. [PASS]
# Test case: connect6: load prog with wrong expected attach type .. [PASS]
# Test case: connect6: attach prog with wrong attach type .. [PASS]
# Test case: connect6: rewrite IP & TCP port .. [PASS]
# Test case: connect6: rewrite IP & UDP port .. [PASS]
# Test case: sendmsg4: load prog with wrong expected attach type .. [PASS]
# Test case: sendmsg4: attach prog with wrong attach type .. [PASS]
# Test case: sendmsg4: rewrite IP & port (asm) .. [PASS]
# Test case: sendmsg4: rewrite IP & port (C) .. [PASS]
# Test case: sendmsg4: deny call .. [PASS]
# Test case: sendmsg6: load prog with wrong expected attach type .. [PASS]
# Test case: sendmsg6: attach prog with wrong attach type .. [PASS]
# Test case: sendmsg6: rewrite IP & port (asm) .. [PASS]
# Test case: sendmsg6: rewrite IP & port (C) .. [PASS]
# Test case: sendmsg6: IPv4-mapped IPv6 .. [PASS]
# Test case: sendmsg6: set dst IP =3D [::] (BSD'ism) .. [PASS]
# Test case: sendmsg6: preserve dst IP =3D [::] (BSD'ism) .. [PASS]
# Test case: sendmsg6: deny call .. [PASS]
# Test case: recvmsg4: return code ok .. [PASS]
# Test case: recvmsg4: return code !ok .. [PASS]
# Test case: recvmsg6: return code ok .. [PASS]
# Test case: recvmsg6: return code !ok .. [PASS]
# Test case: recvmsg4: rewrite IP & port (asm) .. [PASS]
# Test case: recvmsg6: rewrite IP & port (asm) .. [PASS]
# Summary: 35 PASSED, 0 FAILED
ok 26 selftests: bpf: test_sock_addr.sh
# selftests: bpf: test_tunnel.sh
# Testing GRE tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 35ms
# rtt min/avg/max/mdev =3D 0.052/0.111/0.146/0.043 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.048/0.113/0.190/0.059 ms
# =1B[0;92mPASS: gretap=1B[0m
# Testing IP6GRE tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING ::11(::11) 56 data bytes
#=20
# --- ::11 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 69ms
# rtt min/avg/max/mdev =3D 0.070/1030.638/2067.528/844.048 ms, pipe 3
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 40ms
# rtt min/avg/max/mdev =3D 0.057/0.113/0.185/0.054 ms
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 43ms
# rtt min/avg/max/mdev =3D 0.062/0.115/0.210/0.068 ms
# PING fc80::200(fc80::200) 56 data bytes
#=20
# --- fc80::200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 44ms
# rtt min/avg/max/mdev =3D 0.047/0.167/0.242/0.087 ms
# =1B[0;92mPASS: ip6gre=1B[0m
# Testing IP6GRETAP tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING ::11(::11) 56 data bytes
#=20
# --- ::11 ping statistics ---
# 5 packets transmitted, 3 received, 40% packet loss, time 98ms
# rtt min/avg/max/mdev =3D 0.132/0.137/0.141/0.010 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.088/0.192/0.248/0.074 ms
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 43ms
# rtt min/avg/max/mdev =3D 0.046/0.107/0.216/0.077 ms
# PING fc80::200(fc80::200) 56 data bytes
#=20
# --- fc80::200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.081/0.164/0.221/0.060 ms
# =1B[0;92mPASS: ip6gretap=1B[0m
# Testing ERSPAN tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 51ms
# rtt min/avg/max/mdev =3D 0.085/0.113/0.128/0.023 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 65ms
# rtt min/avg/max/mdev =3D 0.046/0.156/0.244/0.083 ms
# =1B[0;92mPASS: erspan=1B[0m
# Testing IP6ERSPAN tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING ::11(::11) 56 data bytes
#=20
# --- ::11 ping statistics ---
# 5 packets transmitted, 3 received, 40% packet loss, time 77ms
# rtt min/avg/max/mdev =3D 0.059/234.742/704.043/331.845 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.095/0.113/0.138/0.021 ms
# =1B[0;92mPASS: ip6erspan=1B[0m
# Testing VXLAN tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 54ms
# rtt min/avg/max/mdev =3D 0.047/0.136/0.189/0.063 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.045/0.134/0.192/0.063 ms
# =1B[0;92mPASS: vxlan=1B[0m
# Testing IP6VXLAN tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING ::11(::11) 56 data bytes
#=20
# --- ::11 ping statistics ---
# 5 packets transmitted, 3 received, 40% packet loss, time 120ms
# rtt min/avg/max/mdev =3D 0.082/0.101/0.126/0.020 ms
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 44ms
# rtt min/avg/max/mdev =3D 0.078/0.155/0.217/0.057 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.046/0.136/0.244/0.082 ms
# =1B[0;92mPASS: ip6vxlan=1B[0m
# Testing GENEVE tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 85ms
# rtt min/avg/max/mdev =3D 0.043/0.057/0.070/0.014 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 45ms
# rtt min/avg/max/mdev =3D 0.045/0.062/0.074/0.014 ms
# =1B[0;92mPASS: geneve=1B[0m
# Testing IP6GENEVE tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 30ms
# rtt min/avg/max/mdev =3D 0.157/1017.252/2027.317/827.600 ms, pipe 2
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 41ms
# rtt min/avg/max/mdev =3D 0.057/0.126/0.210/0.064 ms
# =1B[0;92mPASS: ip6geneve=1B[0m
# Testing IPIP tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 76ms
# rtt min/avg/max/mdev =3D 0.055/0.128/0.176/0.052 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.039/0.128/0.174/0.063 ms
# =1B[0;92mPASS: ipip=1B[0m
# Testing IPIP6 tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING ::11(::11) 56 data bytes
#=20
# --- ::11 ping statistics ---
# 5 packets transmitted, 3 received, 40% packet loss, time 122ms
# rtt min/avg/max/mdev =3D 0.094/0.122/0.144/0.024 ms
# PING 10.1.1.100 (10.1.1.100) 56(84) bytes of data.
#=20
# --- 10.1.1.100 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 43ms
# rtt min/avg/max/mdev =3D 0.075/0.146/0.194/0.051 ms
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 42ms
# rtt min/avg/max/mdev =3D 0.048/0.164/0.232/0.084 ms
# =1B[0;92mPASS: ip6tnl=1B[0m
# Testing IPSec tunnel...
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       6810
# Verifier analysis:
#=20
# Skipped 109 bytes, use 'verb' option for the full verbose log.
# [...]
# tal_size: 6810
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D67
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D68
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC _gre_set_tunnel type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC _gre_get_tunnel type_id=3D17
# [19] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [20] FUNC _ip6gretap_set_tunnel type_id=3D19
# [21] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [22] FUNC _ip6gretap_get_tunnel type_id=3D21
# [23] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [24] FUNC _erspan_set_tunnel type_id=3D23
# [25] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [26] FUNC _erspan_get_tunnel type_id=3D25
# [27] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [28] FUNC _ip4ip6erspan_set_tunnel type_id=3D27
# [29] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [30] FUNC _ip4ip6erspan_get_tunnel type_id=3D29
# [31] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [32] FUNC _vxlan_set_tunnel type_id=3D31
# [33] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [34] FUNC _vxlan_get_tunnel type_id=3D33
# [35] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [36] FUNC _ip6vxlan_set_tunnel type_id=3D35
# [37] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [38] FUNC _ip6vxlan_get_tunnel type_id=3D37
# [39] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [40] FUNC _geneve_set_tunnel type_id=3D39
# [41] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [42] FUNC _geneve_get_tunnel type_id=3D41
# [43] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [44] FUNC _ip6geneve_set_tunnel type_id=3D43
# [45] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [46] FUNC _ip6geneve_get_tunnel type_id=3D45
# [47] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [48] FUNC _ipip_set_tunnel type_id=3D47
# [49] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [50] FUNC _ipip_get_tunnel type_id=3D49
# [51] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [52] FUNC _ipip6_set_tunnel type_id=3D51
# [53] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [54] FUNC _ipip6_get_tunnel type_id=3D53
# [55] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [56] FUNC _ip6ip6_set_tunnel type_id=3D55
# [57] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [58] FUNC _ip6ip6_get_tunnel type_id=3D57
# [59] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [60] FUNC _xfrm_get_state type_id=3D59
# [61] VAR _version type_id=3D15 linkage=3D1
# [62] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [63] ARRAY (anon) type_id=3D62 index_type_id=3D6 nr_elems=3D4
# [64] VAR _license type_id=3D63 linkage=3D1
# [65] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 10.1.1.200 (10.1.1.200) 56(84) bytes of data.
#=20
# --- 10.1.1.200 ping statistics ---
# 3 packets transmitted, 3 received, 0% packet loss, time 76ms
# rtt min/avg/max/mdev =3D 0.066/0.171/0.278/0.087 ms
#             ping-30567   [003] d.s2   635.869135: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   636.919095: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   637.942959: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   635.869135: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   636.919095: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   637.942959: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   635.869135: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   636.919095: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
#             ping-30567   [003] d.s2   637.942959: bpf_trace_printk: reqid=
 1 spi 0x1 remote ip 0xac100164
# =1B[0;92mPASS: xfrm tunnel=1B[0m
# test_tunnel.sh: =1B[0;92mPASS=1B[0m
ok 27 selftests: bpf: test_tunnel.sh
# selftests: bpf: test_lirc_mode2.sh
# ./test_lirc_mode2.sh: line 31: ./test_lirc_mode2_user: No such file or di=
rectory
# =1B[0;31mFAIL: lirc_mode2=1B[0m
ok 28 selftests: bpf: test_lirc_mode2.sh
# selftests: bpf: test_skb_cgroup_id.sh
# Wait for testing link-local IP to become available ... OK
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       1778
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 904
# str_off: 904
# str_len: 850
# btf_total_size: 1778
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D26
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D27
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC log_cgroup_id type_id=3D14
# [17] STRUCT bpf_map_def size=3D20 vlen=3D5
# 	type type_id=3D4 bits_offset=3D0
# 	key_size type_id=3D4 bits_offset=3D32
# 	value_size type_id=3D4 bits_offset=3D64
# 	max_entries type_id=3D4 bits_offset=3D96
# 	map_flags type_id=3D4 bits_offset=3D128
# [18] VAR cgroup_ids type_id=3D17 linkage=3D1
# [19] VAR _version type_id=3D15 linkage=3D1
# [20] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [21] ARRAY (anon) type_id=3D20 index_type_id=3D6 nr_elems=3D4
# [22] VAR _license type_id=3D21 linkage=3D1
# [23] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# [PASS]
ok 29 selftests: bpf: test_skb_cgroup_id.sh
# selftests: bpf: test_flow_dissector.sh
# Testing global flow dissector...
# Error: failed prog attach to map
# Unexpected unsuccessful attach in namespace
# Error: failed prog attach to map
# Error: failed prog attach to map
# Error: failed prog detach from map
# Failed to detach flow dissector
# bpffs not mounted. Mounting...
# Testing IPv4...
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D10
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D0
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D10
# Testing IPIP...
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# ipip_test_mvVM: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_mvVM: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# sit_test_mvVM: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   4
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D10
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# ipip_test_YqGl: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_YqGl: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit_test_YqGl: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   4
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D0
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# ipip_test_ahjJ: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_ahjJ: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit_test_ahjJ: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   4
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D10
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# Testing IPv4 + GRE...
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# ipip_test_1agj: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_1agj: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit_test_1agj: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   47
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D10
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# ipip_test_vJW8: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_vJW8: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit_test_vJW8: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   47
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D0
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# tunnels before test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# ipip_test_s1Vf: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# gre_test_s1Vf: gre/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# sit_test_s1Vf: any/ip remote 127.0.0.2 local 127.0.0.1 dev lo ttl inherit
# inner.dest4: 192.168.0.1
# inner.source4: 1.1.1.1
# encap proto:   47
# outer.dest4: 127.0.0.1
# outer.source4: 127.0.0.2
# pkts: tx=3D10 rx=3D10
# tunnels after test:
# tunl0: any/ip remote any local any ttl inherit nopmtudisc
# gre0: gre/ip remote any local any ttl inherit nopmtudisc
# sit0: ipv6/ip remote any local any ttl 64 nopmtudisc 6rd-prefix 2002::/16
# Testing port range...
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D10
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D0
# inner.dest4: 127.0.0.1
# inner.source4: 127.0.0.3
# pkts: tx=3D10 rx=3D10
# Testing IPv6...
# inner.dest6: ::1
# inner.source6: ::1
# pkts: tx=3D10 rx=3D10
# inner.dest6: ::1
# inner.source6: ::1
# pkts: tx=3D10 rx=3D0
# inner.dest6: ::1
# inner.source6: ::1
# pkts: tx=3D10 rx=3D10
# selftests: test_flow_dissector [FAILED]
not ok 30 selftests: bpf: test_flow_dissector.sh # exit=3D1
# selftests: bpf: test_xdp_vlan_mode_generic.sh
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
#=20
# --- 100.64.41.1 ping statistics ---
# 1 packets transmitted, 0 received, 100% packet loss, time 0ms
#=20
# Success: First ping must fail
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
# 64 bytes from 100.64.41.1: icmp_seq=3D1 ttl=3D64 time=3D1019 ms
# 64 bytes from 100.64.41.1: icmp_seq=3D2 ttl=3D64 time=3D816 ms
#=20
# --- 100.64.41.1 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 203ms
# rtt min/avg/max/mdev =3D 816.238/917.769/1019.301/101.536 ms, pipe 2
# PING 100.64.41.2 (100.64.41.2) 56(84) bytes of data.
# 64 bytes from 100.64.41.2: icmp_seq=3D1 ttl=3D64 time=3D0.023 ms
# 64 bytes from 100.64.41.2: icmp_seq=3D2 ttl=3D64 time=3D0.113 ms
#=20
# --- 100.64.41.2 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 207ms
# rtt min/avg/max/mdev =3D 0.023/0.068/0.113/0.045 ms
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
# 64 bytes from 100.64.41.1: icmp_seq=3D1 ttl=3D64 time=3D0.045 ms
# 64 bytes from 100.64.41.1: icmp_seq=3D2 ttl=3D64 time=3D0.037 ms
#=20
# --- 100.64.41.1 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 208ms
# rtt min/avg/max/mdev =3D 0.037/0.041/0.045/0.004 ms
# PING 100.64.41.2 (100.64.41.2) 56(84) bytes of data.
# 64 bytes from 100.64.41.2: icmp_seq=3D1 ttl=3D64 time=3D0.024 ms
# 64 bytes from 100.64.41.2: icmp_seq=3D2 ttl=3D64 time=3D0.115 ms
#=20
# --- 100.64.41.2 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 203ms
# rtt min/avg/max/mdev =3D 0.024/0.069/0.115/0.046 ms
# selftests: xdp_vlan_mode_generic [PASS]
ok 31 selftests: bpf: test_xdp_vlan_mode_generic.sh
# selftests: bpf: test_xdp_vlan_mode_native.sh
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
#=20
# --- 100.64.41.1 ping statistics ---
# 1 packets transmitted, 0 received, 100% packet loss, time 0ms
#=20
# Success: First ping must fail
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
# 64 bytes from 100.64.41.1: icmp_seq=3D1 ttl=3D64 time=3D1001 ms
# 64 bytes from 100.64.41.1: icmp_seq=3D2 ttl=3D64 time=3D800 ms
#=20
# --- 100.64.41.1 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 201ms
# rtt min/avg/max/mdev =3D 800.342/900.713/1001.085/100.375 ms, pipe 2
# PING 100.64.41.2 (100.64.41.2) 56(84) bytes of data.
# 64 bytes from 100.64.41.2: icmp_seq=3D1 ttl=3D64 time=3D0.029 ms
# 64 bytes from 100.64.41.2: icmp_seq=3D2 ttl=3D64 time=3D0.047 ms
#=20
# --- 100.64.41.2 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 207ms
# rtt min/avg/max/mdev =3D 0.029/0.038/0.047/0.009 ms
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2536
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 976
# str_off: 976
# str_len: 1536
# btf_total_size: 2536
# [1] PTR (anon) type_id=3D2
# [2] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [6] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [7] FUNC xdp_prognum0 type_id=3D5
# [8] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [9] FUNC xdp_prognum1 type_id=3D8
# [10] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [11] FUNC xdp_prognum2 type_id=3D10
# [12] FUNC_PROTO (anon) return=3D6 args=3D(1 ctx)
# [13] FUNC xdp_prognum3 type_id=3D12
# [14] PTR (anon) type_id=3D15
# [15] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D16 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D18 bits_offset=3D800
# 	local_ip6 type_id=3D18 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D19 bits_offset=3D1152
# 	tstamp type_id=3D21 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D23 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [16] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D5
# [17] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodi=
ng=3D(none)
# [18] ARRAY (anon) type_id=3D3 index_type_id=3D17 nr_elems=3D4
# [19] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D20 bits_offset=3D0
# [20] PTR (anon) type_id=3D31
# [21] TYPEDEF __u64 type_id=3D22
# [22] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [23] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D24 bits_offset=3D0
# [24] PTR (anon) type_id=3D32
# [25] FUNC_PROTO (anon) return=3D6 args=3D(14 ctx)
# [26] FUNC _tc_progA type_id=3D25
# [27] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [28] ARRAY (anon) type_id=3D27 index_type_id=3D17 nr_elems=3D4
# [29] VAR _license type_id=3D28 linkage=3D1
# [30] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PING 100.64.41.1 (100.64.41.1) 56(84) bytes of data.
# 64 bytes from 100.64.41.1: icmp_seq=3D1 ttl=3D64 time=3D0.048 ms
# 64 bytes from 100.64.41.1: icmp_seq=3D2 ttl=3D64 time=3D0.041 ms
#=20
# --- 100.64.41.1 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 208ms
# rtt min/avg/max/mdev =3D 0.041/0.044/0.048/0.007 ms
# PING 100.64.41.2 (100.64.41.2) 56(84) bytes of data.
# 64 bytes from 100.64.41.2: icmp_seq=3D1 ttl=3D64 time=3D0.039 ms
# 64 bytes from 100.64.41.2: icmp_seq=3D2 ttl=3D64 time=3D0.162 ms
#=20
# --- 100.64.41.2 ping statistics ---
# 2 packets transmitted, 2 received, 0% packet loss, time 203ms
# rtt min/avg/max/mdev =3D 0.039/0.100/0.162/0.062 ms
# selftests: xdp_vlan_mode_native [PASS]
ok 32 selftests: bpf: test_xdp_vlan_mode_native.sh
# selftests: bpf: test_lwt_ip_encap.sh
# starting egress IPv4 encap test=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# starting egress IPv6 encap test=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# starting ingress IPv4 encap test=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# starting ingress IPv6 encap test=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# starting egress IPv4 encap test vrf red
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# ping: sendmsg: No route to host
# ping: sendmsg: No route to host
# PASS
# starting egress IPv6 encap test vrf red
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# ping: sendmsg: No route to host
# ping: sendmsg: No route to host
# PASS
# starting ingress IPv4 encap test vrf red
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# starting ingress IPv6 encap test vrf red
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2162
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 784
# str_off: 784
# str_len: 1354
# btf_total_size: 2162
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D23
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D24
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC bpf_lwt_encap_gre type_id=3D14
# [17] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [18] FUNC bpf_lwt_encap_gre6 type_id=3D17
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR _license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# PASS
# passed tests: 8
# failed tests: 0
ok 33 selftests: bpf: test_lwt_ip_encap.sh
# selftests: bpf: test_tcp_check_syncookie.sh
# net.ipv4.tcp_syncookies =3D 2
# net.ipv4.tcp_window_scaling =3D 0
# net.ipv4.tcp_timestamps =3D 0
# net.ipv4.tcp_sack =3D 0
# Wait for IP 127.0.0.1 to become available . OK
# Wait for IP ::1 to become available . OK
# Testing clsact...
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       3268
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 992
# str_off: 992
# str_len: 2252
# btf_total_size: 3268
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D28
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D29
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC check_syncookie_clsact type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC check_syncookie_xdp type_id=3D19
# [21] STRUCT bpf_map_def size=3D20 vlen=3D5
# 	type type_id=3D4 bits_offset=3D0
# 	key_size type_id=3D4 bits_offset=3D32
# 	value_size type_id=3D4 bits_offset=3D64
# 	max_entries type_id=3D4 bits_offset=3D96
# 	map_flags type_id=3D4 bits_offset=3D128
# [22] VAR results type_id=3D21 linkage=3D1
# [23] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [24] ARRAY (anon) type_id=3D23 index_type_id=3D6 nr_elems=3D4
# [25] VAR _license type_id=3D24 linkage=3D1
# [26] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# ok
# Testing XDP...
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       3268
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 992
# str_off: 992
# str_len: 2252
# btf_total_size: 3268
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D28
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D29
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC check_syncookie_clsact type_id=3D14
# [17] PTR (anon) type_id=3D18
# [18] STRUCT xdp_md size=3D24 vlen=3D6
# 	data type_id=3D3 bits_offset=3D0
# 	data_end type_id=3D3 bits_offset=3D32
# 	data_meta type_id=3D3 bits_offset=3D64
# 	ingress_ifindex type_id=3D3 bits_offset=3D96
# 	rx_queue_index type_id=3D3 bits_offset=3D128
# 	egress_ifindex type_id=3D3 bits_offset=3D160
# [19] FUNC_PROTO (anon) return=3D15 args=3D(17 ctx)
# [20] FUNC check_syncookie_xdp type_id=3D19
# [21] STRUCT bpf_map_def size=3D20 vlen=3D5
# 	type type_id=3D4 bits_offset=3D0
# 	key_size type_id=3D4 bits_offset=3D32
# 	value_size type_id=3D4 bits_offset=3D64
# 	max_entries type_id=3D4 bits_offset=3D96
# 	map_flags type_id=3D4 bits_offset=3D128
# [22] VAR results type_id=3D21 linkage=3D1
# [23] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [24] ARRAY (anon) type_id=3D23 index_type_id=3D6 nr_elems=3D4
# [25] VAR _license type_id=3D24 linkage=3D1
# [26] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# ok
ok 34 selftests: bpf: test_tcp_check_syncookie.sh
# selftests: bpf: test_tc_edt.sh
#=20
# BTF debug data section '.BTF' rejected: Invalid argument (22)!
#  - Length:       2534
# Verifier analysis:
#=20
# magic: 0xeb9f
# version: 1
# flags: 0x0
# hdr_len: 24
# type_off: 0
# type_len: 864
# str_off: 864
# str_len: 1646
# btf_total_size: 2534
# [1] PTR (anon) type_id=3D2
# [2] STRUCT __sk_buff size=3D184 vlen=3D32
# 	len type_id=3D3 bits_offset=3D0
# 	pkt_type type_id=3D3 bits_offset=3D32
# 	mark type_id=3D3 bits_offset=3D64
# 	queue_mapping type_id=3D3 bits_offset=3D96
# 	protocol type_id=3D3 bits_offset=3D128
# 	vlan_present type_id=3D3 bits_offset=3D160
# 	vlan_tci type_id=3D3 bits_offset=3D192
# 	vlan_proto type_id=3D3 bits_offset=3D224
# 	priority type_id=3D3 bits_offset=3D256
# 	ingress_ifindex type_id=3D3 bits_offset=3D288
# 	ifindex type_id=3D3 bits_offset=3D320
# 	tc_index type_id=3D3 bits_offset=3D352
# 	cb type_id=3D5 bits_offset=3D384
# 	hash type_id=3D3 bits_offset=3D544
# 	tc_classid type_id=3D3 bits_offset=3D576
# 	data type_id=3D3 bits_offset=3D608
# 	data_end type_id=3D3 bits_offset=3D640
# 	napi_id type_id=3D3 bits_offset=3D672
# 	family type_id=3D3 bits_offset=3D704
# 	remote_ip4 type_id=3D3 bits_offset=3D736
# 	local_ip4 type_id=3D3 bits_offset=3D768
# 	remote_ip6 type_id=3D7 bits_offset=3D800
# 	local_ip6 type_id=3D7 bits_offset=3D928
# 	remote_port type_id=3D3 bits_offset=3D1056
# 	local_port type_id=3D3 bits_offset=3D1088
# 	data_meta type_id=3D3 bits_offset=3D1120
# 	(anon) type_id=3D8 bits_offset=3D1152
# 	tstamp type_id=3D10 bits_offset=3D1216
# 	wire_len type_id=3D3 bits_offset=3D1280
# 	gso_segs type_id=3D3 bits_offset=3D1312
# 	(anon) type_id=3D12 bits_offset=3D1344
# 	gso_size type_id=3D3 bits_offset=3D1408
# [3] TYPEDEF __u32 type_id=3D4
# [4] INT unsigned int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3D(no=
ne)
# [5] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D5
# [6] INT __ARRAY_SIZE_TYPE__ size=3D4 bits_offset=3D0 nr_bits=3D32 encodin=
g=3D(none)
# [7] ARRAY (anon) type_id=3D3 index_type_id=3D6 nr_elems=3D4
# [8] UNION (anon) size=3D8 vlen=3D1
# 	flow_keys type_id=3D9 bits_offset=3D0
# [9] PTR (anon) type_id=3D24
# [10] TYPEDEF __u64 type_id=3D11
# [11] INT long long unsigned int size=3D8 bits_offset=3D0 nr_bits=3D64 enc=
oding=3D(none)
# [12] UNION (anon) size=3D8 vlen=3D1
# 	sk type_id=3D13 bits_offset=3D0
# [13] PTR (anon) type_id=3D25
# [14] FUNC_PROTO (anon) return=3D15 args=3D(1 skb)
# [15] INT int size=3D4 bits_offset=3D0 nr_bits=3D32 encoding=3DSIGNED
# [16] FUNC tc_prog type_id=3D14
# [17] STRUCT bpf_map_def size=3D20 vlen=3D5
# 	type type_id=3D4 bits_offset=3D0
# 	key_size type_id=3D4 bits_offset=3D32
# 	value_size type_id=3D4 bits_offset=3D64
# 	max_entries type_id=3D4 bits_offset=3D96
# 	map_flags type_id=3D4 bits_offset=3D128
# [18] VAR flow_map type_id=3D17 linkage=3D1
# [19] INT char size=3D1 bits_offset=3D0 nr_bits=3D8 encoding=3DSIGNED
# [20] ARRAY (anon) type_id=3D19 index_type_id=3D6 nr_elems=3D4
# [21] VAR __license type_id=3D20 linkage=3D1
# [22] DATASEC license size=3D0 vlen=3D1 size =3D=3D 0
#=20
# elapsed: 20 sec; bps difference: 0.08%
# PASS
ok 35 selftests: bpf: test_tc_edt.sh
# selftests: bpf: test_xdping.sh
# Test client args '-I veth1 -S'; server args ''
# PING 10.1.1.100 (10.1.1.100) from 10.1.1.200 veth1: 56(84) bytes of data.
# 64 bytes from 10.1.1.100: icmp_seq=3D1 ttl=3D64 time=3D0.041 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D2 ttl=3D64 time=3D0.104 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D3 ttl=3D64 time=3D0.069 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D8 ttl=3D64 time=3D0.059 ms
#=20
# --- 10.1.1.100 ping statistics ---
# 4 packets transmitted, 4 received, 0% packet loss, time 115ms
# rtt min/avg/max/mdev =3D 0.041/0.068/0.104/0.023 ms
# Setting up XDP for veth1, please wait...
# XDP setup disrupts network connectivity, hit Ctrl+C to quit
#=20
# Normal ping RTT data
# [Ignore final RTT; it is distorted by XDP using the reply]
#=20
# XDP RTT data:
# 64 bytes from 10.1.1.100: icmp_seq=3D5 ttl=3D64 time=3D0.00464 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D6 ttl=3D64 time=3D0.00356 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D7 ttl=3D64 time=3D0.00350 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D8 ttl=3D64 time=3D0.00348 ms
# Test client args '-I veth1 -S'; server args '': PASS
# Test client args '-I veth1 -S -c 10'; server args ''
# PING 10.1.1.100 (10.1.1.100) from 10.1.1.200 veth1: 56(84) bytes of data.
# 64 bytes from 10.1.1.100: icmp_seq=3D1 ttl=3D64 time=3D0.018 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D2 ttl=3D64 time=3D0.111 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D3 ttl=3D64 time=3D0.053 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D4 ttl=3D64 time=3D0.086 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D5 ttl=3D64 time=3D0.058 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D6 ttl=3D64 time=3D0.104 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D7 ttl=3D64 time=3D0.047 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D8 ttl=3D64 time=3D0.059 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D9 ttl=3D64 time=3D0.076 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D20 ttl=3D64 time=3D0.249 ms
#=20
# --- 10.1.1.100 ping statistics ---
# 10 packets transmitted, 10 received, 0% packet loss, time 259ms
# rtt min/avg/max/mdev =3D 0.018/0.086/0.249/0.060 ms
# Setting up XDP for veth1, please wait...
# XDP setup disrupts network connectivity, hit Ctrl+C to quit
#=20
# Normal ping RTT data
# [Ignore final RTT; it is distorted by XDP using the reply]
#=20
# XDP RTT data:
# 64 bytes from 10.1.1.100: icmp_seq=3D11 ttl=3D64 time=3D0.01559 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D12 ttl=3D64 time=3D0.01258 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D13 ttl=3D64 time=3D0.01245 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D14 ttl=3D64 time=3D0.01257 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D15 ttl=3D64 time=3D0.01256 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D16 ttl=3D64 time=3D0.01251 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D17 ttl=3D64 time=3D0.01257 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D18 ttl=3D64 time=3D0.01256 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D19 ttl=3D64 time=3D0.01284 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D20 ttl=3D64 time=3D0.01246 ms
# Test client args '-I veth1 -S -c 10'; server args '': PASS
# Test client args '-I veth1 -S'; server args '-I veth0 -s -S'
# PING 10.1.1.100 (10.1.1.100) from 10.1.1.200 veth1: 56(84) bytes of data.
# 64 bytes from 10.1.1.100: icmp_seq=3D1 ttl=3D64 time=3D0.014 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D2 ttl=3D64 time=3D0.016 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D3 ttl=3D64 time=3D0.014 ms
# 64 bytes from 10.1.1.100: icmp_seq=3D8 ttl=3D64 time=3D0.018 ms
#=20
# --- 10.1.1.100 ping statistics ---
# 4 packets transmitted, 4 received, 0% packet loss, time 95ms
# rtt min/avg/max/mdev =3D 0.014/0.015/0.018/0.004 ms
# Setting up XDP for veth1, please wait...
